public/ephemeris/2025-05-20.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>

<div id="outline-container-org1f1aff8" class="outline-2">
<h2 id="org1f1aff8">2025-05-20 - Struggles with NetworkManager</h2>
<div class="outline-text-2" id="text-org1f1aff8">
<p>
Hi,
</p>

<p>
today I continued what I left off yesterday with my local kubernetes
cluster. To recap, I am bootstrapping a local cluster to test a
kubernetes operator and I want to have full control of the cluster
while being easy to hack.
</p>

<p>
Yesterday I spawned up the virtual machines and connected them to the
same network, today I wanted to configure the kubernetes daemons but
something was pissing me off. During the first boot of the machine,
NetworkManager spawns up and looks for available networks for about 1
minute and 30 seconds. But since I need to manually setup a static ip,
it fails and the kernel boots with error messages, not really
pretty. Afterwards, cloud-init setups up the static ip, restarts
NetworkManager and everything would work on next boots. Still this
error was really bothering me, so I tried to fix this.
</p>

<p>
The root of the problem is that I need to set a static ip before
systemd starts the daemons, but I was not able to do so without the
daemons (for example "nmcli connection up" would not work because I
had no NetworkManager running). So I tried setting up the connection
files for NetworkManager and networkd but they would be read only
after initializing the service, so after hanging for one and an half
minutes and showing the error. This problem got me for a while. My
second idea was to disable those services completely but I was not
able to do so before the first boot. And I tried, I even set all the
/etc files with "NetworkManager" in the name to link to /dev/null but
that did not stop the daemon from starting up and failing, so I tried
to override them but that would not work either. I made sure there
were no other services that would depend on NetowrkManager.
</p>

<p>
I looked up online and I found out I could use cloud-init to setup the
network, so I tried that but nothing would happen. I tried to change the
configuration at least 20 times but I got no feedback so I started
thinking that maybe the network configuration was not being applied at
all. Some struggling later I found out that the network configuration
could not stay in the same yaml file as the rest of the configuration,
but it needed to be a separate file. Additionally, I needed to pass
this file to a program called cloud-localds via the &#x2013;network-config
flag. I was using genisoimage previously and it does not have a
similar flag, so I needed to use this other program. Very intuitive
things. So this finally worked and I have a static ip at boot time.
</p>

<p>
Maybe there were many ways to solve this, but for the entire day I
basically got zero feedback on my attempts. Journalctl would not log
anything, genisoimage would not hint that I couldn't configure the
network in the user-data file, it wouldn't say anything even for
spelling mistakes. NetworkManager and systemd was completely ignoring
all the files that I changed or removed, everything was a black box to
me. Error messages are important&#x2026;
</p>

<p>
So finally I could boot the images nicely, I can now setup kubernetes.
I wrote scripts to automate this, then I got missing certificates
and I called it a day, see you tomorrow.
</p>

<p>
The rest of the day I studied flow algorithms and physics. A nice
patch for linux 6.16 promises to improve swap operations by 20-30%
which Is really impressive. Honestly, If I had infinite time and money
I would work all day and night on my operating system, but I have to
do things and start earning a salary so I will leave this for another
day.
</p>

<p>
&#x2013; Giovanni
</p>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
